/*відповідає за взаємодію з API сервісу Pixabay — тобто робить HTTP-запити, отримує від сервера дані (зображення) за заданим пошуковим запитом і повертає їх у вигляді обробленого результату.*/

// Імпортую бібліотеку для HTTP-запитів
import axios from 'axios';

//Створюю константи для роботи з API Pixabay
const API_KEY = '50290691-d51719558e36c91c48babc26d'; // Мій унікальний  API-ключ сервісу Pexibay

const BASE_URL = 'https://pixabay.com/api/'; // Базова URL-адреса для запитів

const PER_PAGE = 15;

// Функція для отримання зображень за пошуковим запитом
export async function getImagesByQuery(query, page = 1) {
  // перевірка отриманого параметра функції
  // console.log('Виклик функції getImagesByQuery із запитом:', query);

  /*Створюю змінну де кладу параметри запиту, які будуть передані у URL.Використовуючи цю змінну, я передаю параметри у функцію axios.get, яка додає їх до запиту в форматі URL-параметрів (query string).*/
  const params = {
    key: API_KEY, // Мій ключ для автентифікації
    q: query, // Пошукове слово, що користувач ввів в пошукове поле
    image_type: 'photo', // фільтрую лише зображення
    orientation: 'horizontal', // Орієнтація зображень-горізогтальна
    safesearch: true, // Фільтр для безпечного пошуку
    per_page: 15, // Максимальна кількість результатів за запитом
    page: page,
  };

  //тут я прописую обробку помилки яка може виникнути під час запиту.Відбувається виклик axios.get  
  try {
    // Виконую GET-запит до API з використанням axios
    const response = await axios.get(BASE_URL, { params });

  

    // Повертаю дані (масив зображень hits)
    return response.data;

  } catch (error) {
    // Якщо сталася помилка, викидаю її для обробки на рівні виклику функції
    throw error;
  }
}